Minor Changes to README
